{
  "start": {
    "text": "Un événement mystérieux s'est produit. Nous ignorons ce qui s'est vraiment passé, mais les parrains de l'initiative open source semblent vouloir y mettre fin... et personne ne sait pourquoi. La majorité des logiciels et solutions dans le monde reposent sur des outils open source pour fonctionner sans accroc.\n\nVous êtes un programmeur et devez choisir un langage de programmation comme arme pour enquêter sur cette énigme. Votre mission ? Découvrir la vérité et empêcher une catastrophe mondiale.\n\nFaites preuve d'ingéniosité : chaque défi nécessitera vos connaissances en algorithmes et structures de données pour avancer dans l'histoire.",
    "choices": [
      {
        "text": "Choisir Python",
        "link": "pythonStart"
      },
      {
        "text": "Choisir JavaScript",
        "link": "javascriptStart"
      }
    ]
  },
  "pythonStart": {
    "text": "Vous avez choisi Python, votre fidèle compagnon de codage. Vous commencez par écrire un script pour collecter des données provenant de multiples dépôts open source. Les indices peuvent se cacher dans les commits récents, les pull requests, ou encore les forks étranges. Vous sentez une tension croissante, comme si une vérité dérangeante était sur le point d'être révélée.",
    "choices": [
      {
        "text": "Analyser les données avec Pandas",
        "link": "analyzeDataPython"
      },
      {
        "text": "Visualiser les données avec Matplotlib",
        "link": "visualizeDataPython"
      }
    ]
  },
  "javascriptStart": {
    "text": "Vous avez choisi JavaScript, le langage polyvalent des développeurs. Vous commencez par créer une application web qui surveille les commits, les pull requests et les discussions en temps réel sur les dépôts open source. Les données défilent rapidement, et vous devez rester vigilant pour ne pas manquer d'étranges indices.",
    "choices": [
      {
        "text": "Utiliser D3.js pour visualiser l'historique des commits",
        "link": "visualizeDataJS"
      },
      {
        "text": "Automatiser la récupération des données avec Node.js",
        "link": "fetchDataJS"
      }
    ]
  },
  "analyzeDataPython": {
    "text": "Avec Pandas, vous chargez les données dans un DataFrame et commencez à examiner les tendances. Une série de commits répétés par un utilisateur inconnu attire votre attention. À chaque ligne de code, une question : est-ce un bug, une erreur... ou une intention cachée ?",
    "choices": [
      {
        "text": "Enquêter sur les commits suspects",
        "link": "investigateCommitsPython"
      },
      {
        "text": "Ignorer ces commits et chercher d'autres indices",
        "link": "lookForCluesPython"
      }
    ]
  },
  "visualizeDataPython": {
    "text": "Avec Matplotlib, vous créez plusieurs graphiques pour mieux comprendre les données. Un pic soudain d'activité dans un dépôt attire immédiatement votre attention. Tout semble trop parfait pour être une coïncidence.",
    "choices": [
      {
        "text": "Examiner le dépôt avec le pic d'activité",
        "link": "investigateSpikePython"
      },
      {
        "text": "Ignorer et analyser d'autres dépôts",
        "link": "checkOtherReposPython"
      }
    ]
  },
  "visualizeDataJS": {
    "text": "Avec D3.js, vous construisez une visualisation interactive des données. Les courbes et les graphiques dévoilent une étrange irrégularité dans l'activité des commits d'un dépôt particulier. Le mystère s'épaissit.",
    "choices": [
      {
        "text": "Explorer le dépôt avec les motifs inhabituels",
        "link": "investigatePatternsJS"
      },
      {
        "text": "Ignorer et visualiser d'autres données",
        "link": "visualizeOtherDataJS"
      }
    ]
  },
  "fetchDataJS": {
    "text": "Grâce à Node.js, vous automatisez la collecte des données de plusieurs dépôts. Vous découvrez une série de pull requests marquées comme \"urgentes\" mais émanant de comptes récemment créés. Votre instinct vous dit de creuser plus loin.",
    "choices": [
      {
        "text": "Examiner les pull requests suspectes",
        "link": "investigatePullRequestsJS"
      },
      {
        "text": "Ignorer et collecter plus de données",
        "link": "fetchMoreDataJS"
      }
    ]
  },
  "investigateCommitsPython": {
    "text": "Vous plongez dans les commits suspects et découvrez un modèle étrange : chaque commit inclut des modifications presque insignifiantes, mais leur fréquence est anormalement élevée. Une chaîne de caractères codée apparaît dans les messages de commit.",
    "choices": [
      {
        "text": "Décrypter la chaîne de caractères",
        "link": "decryptStringPython"
      },
      {
        "text": "Analyser les autres dépôts pour des schémas similaires",
        "link": "scanOtherReposPython"
      }
    ]
  },
  "investigateSpikePython": {
    "text": "En analysant le dépôt avec le pic d'activité, vous trouvez un fichier README récemment modifié. Le contenu est cryptique, avec des références à une \"confrérie\" et des messages cachés en stéganographie.",
    "choices": [
      {
        "text": "Utiliser Python pour analyser les messages cachés",
        "link": "analyzeHiddenMessagesPython"
      },
      {
        "text": "Chercher d'autres fichiers modifiés",
        "link": "findOtherFilesPython"
      }
    ]
  },
  "investigatePatternsJS": {
    "text": "Votre visualisation D3.js met en lumière un utilisateur mystérieux qui a fait plusieurs commits en pleine nuit, chaque jour, à la même heure exacte. Une adresse IP associée semble pointer vers un lieu isolé.",
    "choices": [
      {
        "text": "Traquer l'adresse IP",
        "link": "traceIPJS"
      },
      {
        "text": "Examiner le contenu des commits",
        "link": "examineCommitsJS"
      }
    ]
  },
  "investigatePullRequestsJS": {
    "text": "Les pull requests suspectes sont remplies de changements inutiles et mal documentés, mais leur objectif réel semble être de détourner l'attention des mainteneurs. Vous trouvez une discussion privée mentionnant un \"projet final\".",
    "choices": [
      {
        "text": "Essayer de pirater la discussion privée",
        "link": "hackDiscussionJS"
      },
      {
        "text": "Notifier les mainteneurs du dépôt",
        "link": "notifyMaintainersJS"
      }
    ]
  },
  "decryptStringPython": {
    "text": "Vous utilisez Python pour tenter de décrypter la chaîne de caractères trouvée dans les commits suspects. Après plusieurs tentatives, vous révélez un message inquiétant : \"La fin commence ici. La vérité est dans les ombres.\"",
    "choices": [
      {
        "text": "Chercher des indices sur les 'ombres' dans les commits",
        "link": "searchShadowsCommitsPython"
      },
      {
        "text": "Revenir en arrière et examiner d'autres dépôts",
        "link": "scanOtherReposPython"
      }
    ]
  },
  "scanOtherReposPython": {
    "text": "En scannant d'autres dépôts, vous trouvez un modèle similaire : des commits fréquents et anodins contenant des chaînes de caractères cryptées. L'énigme s'étend bien au-delà d'un seul dépôt.",
    "choices": [
      {
        "text": "Créer un script pour automatiser le décryptage de toutes les chaînes",
        "link": "automateDecryptPython"
      },
      {
        "text": "Concentrer vos efforts sur les dépôts les plus actifs",
        "link": "focusActiveReposPython"
      }
    ]
  },
  "analyzeHiddenMessagesPython": {
    "text": "Avec des outils Python, vous analysez les messages cachés dans le fichier README. Vous découvrez une carte cryptée qui semble pointer vers une organisation secrète opérant sous le nom de 'The Obscura Collective'.",
    "choices": [
      {
        "text": "Essayer de localiser 'The Obscura Collective'",
        "link": "locateObscuraPython"
      },
      {
        "text": "Partager la carte sur un forum open source pour obtenir de l'aide",
        "link": "shareMapPython"
      }
    ]
  },
  "findOtherFilesPython": {
    "text": "En fouillant d'autres fichiers modifiés récemment, vous trouvez un script qui semble automatiser la suppression de certains projets open source. Les commentaires du script mentionnent une \"opération d'éradication\".",
    "choices": [
      {
        "text": "Étudier le script en profondeur pour comprendre son objectif",
        "link": "analyzeEradicationScriptPython"
      },
      {
        "text": "Tenter de désactiver le script",
        "link": "disableEradicationScriptPython"
      }
    ]
  },
  "traceIPJS": {
    "text": "Vous utilisez JavaScript pour traquer l'adresse IP suspecte. Vos recherches révèlent qu'elle mène à un serveur situé dans un bunker abandonné en Europe de l'Est. Quelqu'un tente de couvrir ses traces.",
    "choices": [
      {
        "text": "Lancer une attaque réseau pour accéder au serveur",
        "link": "networkAttackJS"
      },
      {
        "text": "Créer un proxy pour surveiller l'activité du serveur",
        "link": "proxyServerJS"
      }
    ]
  },
  "examineCommitsJS": {
    "text": "En examinant les commits suspects, vous trouvez des références fréquentes à un fichier 'manifesto.txt'. En le récupérant, vous découvrez qu'il contient un manifeste crypté visant à \"libérer le code de ses chaînes\".",
    "choices": [
      {
        "text": "Décrypter le manifeste",
        "link": "decryptManifestoJS"
      },
      {
        "text": "Chercher qui a écrit ce manifeste",
        "link": "findAuthorJS"
      }
    ]
  },
  "hackDiscussionJS": {
    "text": "Vous utilisez vos compétences en JavaScript pour pirater la discussion privée. Vous accédez à un chat où des individus anonymes discutent d'un plan appelé 'Project Eclipse'. Ils mentionnent un \"compte à rebours\".",
    "choices": [
      {
        "text": "Essayer de localiser le serveur du 'Project Eclipse'",
        "link": "locateEclipseServerJS"
      },
      {
        "text": "Tenter de perturber le chat en injectant un script",
        "link": "injectScriptJS"
      }
    ]
  },
  "notifyMaintainersJS": {
    "text": "Vous contactez les mainteneurs du dépôt pour les informer des activités suspectes. L'un d'eux vous répond rapidement : \"C'est plus grave que ce que vous pensez. Rencontrez-moi sur un canal sécurisé.\"",
    "choices": [
      {
        "text": "Rejoindre le canal sécurisé",
        "link": "joinSecureChannelJS"
      },
      {
        "text": "Ignorer et poursuivre votre enquête en solo",
        "link": "continueSoloInvestigationJS"
      }
    ]
  }

}